IGieckI/Split-Inference/firmware/esp32s3/sdkconfig.defaults
# ESP32-S3 devkit - tier A, node 11.

# The chip.
CONFIG_IDF_TARGET="esp32s3"

# common to all three boards
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Task watchdog
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_TASK_WDT_PANIC=y

# D2 throttling via esp_pm_configure
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_HZ=1000

# Brownout detector stays ENABLED (CAM power footgun)
CONFIG_ESP_BROWNOUT_DET=y

# CPU frequency is a measured quantity's input
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# All Phase-1 boards have >=4 MB flash (S3 devkit, AI-Thinker CAM, plain ESP32)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# tier A - Board identified from the module shield
CONFIG_FLEETSPLIT_TIER_A=y
CONFIG_FLEETSPLIT_NODE_ID=11
CONFIG_FLEETSPLIT_ARENA_KB=512
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
# If PSRAM is absent or in the wrong line mode
CONFIG_SPIRAM_IGNORE_NOTFOUND=y

CONFIG_SPIRAM_SPEED_80M=y
